Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/c-api.tmx
Source language: en
Languages: fr

source: Abstract Objects Layer
fr: Couche d'Abstraction des Objets

source: The functions in this chapter interact with Python objects regardless of their type, or with wide classes of object types (e.g. all numerical types, or all sequence types). When used on object types for which they do not apply, they will raise a Python exception.
fr: Dans ce chapitre, les fonctions s'appliquent à des objets Python sans tenir compte de leur type, ou des classes d'objets au sens large (par exemple, tous les types numériques, ou tous les types de séquence). Quand ils sont utilisés sur des types d'objets qui ne correspondent pas, ils lèveront une exception Python.

source: It is not possible to use these functions on objects that are not properly initialized, such as a list object that has been created by :cfunc:`PyList_New`, but whose items have not been set to some non-\ ``NULL`` value yet.
fr: Il n'est pas possible d'utiliser ces fonctions sur des objets qui n'ont pas été correctement initialisés, comme un objet liste qui a été créé avec :cfunc:`PyList_New` mais dont les éléments n'ont pas encore été mis à une valeur non-\ ``NULL``.

source: Allocating Objects on the Heap
fr: Allouer des objets dans le tas

source: See also
fr: Voir aussi

source: To allocate and create extension modules.
fr: Allouer et créer des modules d'extension.

source: Parsing arguments and building values
fr: Analyse des arguments et construction des valeurs

source: These functions are useful when creating your own extensions functions and methods. Additional information and examples are available in :ref:`extending-index`.
fr: Ces fonctions sont utiles pour créer vos propres fonctions et méthodes d'extensions. Des informations supplémentaires et des exemples sont disponibles ici: ref:`extending-index`.

source: The first three of these functions described, :cfunc:`PyArg_ParseTuple`, :cfunc:`PyArg_ParseTupleAndKeywords`, and :cfunc:`PyArg_Parse`, all use *format strings* which are used to tell the function about the expected arguments. The format strings use the same syntax for each of these functions.
fr: Dans Les trois premières de ces fonctions décrites, :cfunc: `PyArg_ParseTuple`, :cfunc: `PyArg_ParseTupleAndKeywords`, et :cfunc: `PyArg_Parse`, toutes utilisent *des chaînes de format* qui sont utilisées pour indiquer à la fonction les arguments attendus. Les chaînes de format utilise la même syntaxe pour chacune de ces fonctions.

source: Parsing arguments
fr: Analyse des arguments

source: A format string consists of zero or more "format units." A format unit describes one Python object; it is usually a single character or a parenthesized sequence of format units. With a few exceptions, a format unit that is not a parenthesized sequence normally corresponds to a single address argument to these functions. In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that matches the format unit; and the entry in [square] brackets is the type of the C variable(s) whose address should be passed.
fr: Une chaîne de format se compose de zéro ou plusieurs "unités de format". Une unité de format décrit un objet Python, elle est généralement composée d'un seul caractère ou d'une séquence d'unités de format entre parenthèses. À quelques exceptions près, une unité de format qui n'est pas une séquence entre parenthèses correspond normalement à un argument d'une seule adresse pour ces fonctions. Dans la description qui suit, la forme entre guillemets est l'unité de format, l'entrée entre parenthèses est le type d'objet Python qui correspond à l'unité de format, et l'entrée entre crochets est le type de la variable C (ou des variables) dont l'adresse doit être donnée.

source: Strings and buffers
fr: Chaînes et tampons

source: These formats do not expect you to provide raw storage for the returned string or bytes. Also, you won't have to release any memory yourself, except with the ``es``, ``es#``, ``et`` and ``et#`` formats.
fr: Ces formats n'attendent pas que vous fournissiez un stockage sous forme brute pour les chaînes ou octets retournés. Alors, vous n'aurez pas à libérer la mémoire vous-même, excepté pour les formats ``es``, ``es#``, ``et`` et ``et#``.

source: However, when a :ctype:`Py_buffer` structure gets filled, the underlying buffer is locked so that the caller can subsequently use the buffer even inside a :ctype:`Py_BEGIN_ALLOW_THREADS` block without the risk of mutable data being resized or destroyed. As a result, **you have to call** :cfunc:`PyBuffer_Release` after you have finished processing the data (or in any early abort case).
fr: Néanmoins, quand une structure :ctype:`Py_buffer` est en cours de remplissage, le tampon sous-jacent est verrouillé pour permettre à l'appelant d'utiliser le buffer par la suite, même lorsqu'il est à 'intérieur d'un bloc :ctype:`Py_BEGIN_ALLOW_THREADS`. Ceci sans le risque pour les données mutables de voir leur taille changée ou d'être supprimées. En conséquence, **il vous appartient d'appeler** :cfunc:`PyBuffer_Release` après que vous ayez terminé de traiter les données (ou après une interruption prémataturée du traitement de ces données).

source: Unless otherwise stated, buffers are not NUL-terminated.
fr: Sauf indication contraire, les tampons ne se terminent pas par NUL.

source: For all ``#`` variants of formats (``s#``, ``y#``, etc.), the type of the length argument (int or :ctype:`Py_ssize_t`) is controlled by defining the macro :cmacro:`PY_SSIZE_T_CLEAN` before including :file:`Python.h`. If the macro was defined, length is a :ctype:`Py_ssize_t` rather than an :ctype:`int`. This behavior will change in a future Python version to only support :ctype:`Py_ssize_t` and drop :ctype:`int` support. It is best to always define :cmacro:`PY_SSIZE_T_CLEAN`.
fr: Pour toutes les variantes de formats ``#`` (``s#``, ``y#``, etc), le type de l'argument longueur (int ou :ctype:`Py_ssize_t`) est contrôlé en définissant la macro :cmacro:`PY_SSIZE_T_CLEAN` avant d'inclure le fichier :file:`Python.h`. Si la macro est définie, la longueur est de type :ctype:`Py_ssize_t` au lieu d'être de type :ctype:`int`. Ce comportement changera dans une future version de Python, qui supportera seulement :ctype:`Py_ssize_t` et plus :ctype:`int`. Il est préférable de toujours définir :cmacro:`PY_SSIZE_T_CLEAN`.

source: Convert a Unicode object to a C pointer to a character string. A pointer to an existing string is stored in the character pointer variable whose address you pass. The C string is NUL-terminated. The Python string must not contain embedded NUL bytes; if it does, a :exc:`TypeError` exception is raised. Unicode objects are converted to C strings using ``'utf-8'`` encoding. If this conversion fails, a :exc:`UnicodeError` is raised.
fr: Convertir un objet Unicode en un pointeur C sur une chaîne de caractères. Un pointeur sur une chaîne existante est stocké dans le pointeur de la variable caractère dont vous passez l'adresse. La chaîne C est terminée par le caractère NUL. La chaîne Python ne doit pas contenir d'octets NUL, sinon une exception de type :exc:`TypeError` sera levée. Les objets Unicode sont convertis en chaîne de caractères C avec l'encodage ``'utf-8'``. Si la conversion échoue, une exception :exc:`UnicodeError` sera levée.

source: This format does not accept bytes-like objects. If you want to accept filesystem paths and convert them to C character strings, it is preferrable to use the ``O&`` format with :cfunc:`PyUnicode_FSConverter` as *converter*.
fr: Ce format n'accepte pas les objets de type octets. Si vous voulez accepter des chemins de fichiers et les convertir en chaînes de caractères C, il vaut mieux utiliser le format ``O&`` avec :cfunc:`PyUnicode_FSConverter` comme *convertisseur*.

source: This format accepts Unicode objects as well as objects supporting the buffer protocol. It fills a :ctype:`Py_buffer` structure provided by the caller. In this case the resulting C string may contain embedded NUL bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
fr: Ce format accepte aussi bien les objets Unicode que des objets supportant le protocole de mémoire tampon.Il remplit une structure :ctype:`Py_buffer` fournie par l'appelant. Dans ce cas, La chaîne C qui en résulte peut contenir des octets NUL. Les objets Unicode sont convertis en chaînes C en utilisant un encodage ``'utf-8' ``.

source: Like ``s*``, except that it doesn't accept mutable buffer-like objects such as :class:`bytearray`. The result is stored into two C variables, the first one a pointer to a C string, the second one its length. The string may contain embedded null bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
fr: Comme ``s*``, excepté qu'il n'accepte pas d'objets de type tampons mutables, comme :class:`bytearray`. Le résultat est stocké dans deux variables C, la première étant un pointeur sur une chaîne de caractères C, la seconde étant sa longueur. La chaîne de caractère peut contenir des octets nuls. Les objets Unicode sont convertis en chaînes de caractères C avec l'encodage ``'utf-8'``.

source: Like ``s``, but the Python object may also be ``None``, in which case the C pointer is set to *NULL*.
fr: Comme ``s``, mais l'objet Python peut aussi être ``None``, auquel cas le pointeur C devient *NULL*.

source: Like ``s*``, but the Python object may also be ``None``, in which case the ``buf`` member of the :ctype:`Py_buffer` structure is set to *NULL*.
fr: Comme ``s*``, mais l'objet Python peut aussi être ``None``, dans ce cas le champ ``buf`` de la structure :ctype:`Py_buffer` est définie à *NULL*.

source: Like ``s#``, but the Python object may also be ``None``, in which case the C pointer is set to *NULL*.
fr: Comme ``s#``, mais l'objet Python peut également être ``None``, dans ce cas le pointeur C est définie à *NULL*.

source: This format converts a bytes-like object to a C pointer to a character string; it does not accept Unicode objects. The bytes buffer must not contain embedded NUL bytes; if it does, a :exc:`TypeError` exception is raised.
fr: Ce format converti un objet contenant des octets en un pointeur C sur une chaîne de caractères, il n'accepte pas d'objets Unicode. Le buffer ne doit pas contenir d'octets NUL ; s'il en contient, une exception :exc:`TypeError` sera levée.

source: This variant on ``s*`` doesn't accept Unicode objects, only objects supporting the buffer protocol. **This is the recommended way to accept binary data.**
fr: Cette variante sur ``s*`` n'accepte pas d'objets Unicode, seulement des objets supportant le protocole buffer. **C'est le moyen recommandé pour accepter des données binaires.**

source: This variant on ``s#`` doesn't accept Unicode objects, only bytes-like objects.
fr: Cette variante de ``s#`` n'accepte pas les objets Unicode, uniquement des objets assimilés à des octets.

source: Requires that the Python object is a :class:`bytes` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a bytes object. The C variable may also be declared as :ctype:`PyObject\*`.
fr: Nécessite que l'objet Python soit un objet class:`bytes`, sans tenter de faire aucune conversion au préalable. Si l'objet n'est pas un objet de type octets, une exception :exc:`TypeError` sera levée. La variable C peut également être de type :ctype:`PyObject\*`.

source: Requires that the Python object is a :class:`bytearray` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a :class:`bytearray` object. The C variable may also be declared as :ctype:`PyObject\*`.
fr: Nécessite que l'objet Python soit un objet :class:`bytearray`, sans tenter de faire aucune conversion. Si l'objet n'est pas un objet de type :class:`bytearray`, une exception :exc:`TypeError` sera levée. La variable C peut aussi être de type :ctype:`PyObject\*`.

source: Convert a Python Unicode object to a C pointer to a NUL-terminated buffer of Unicode characters. You must pass the address of a :ctype:`Py_UNICODE` pointer variable, which will be filled with the pointer to an existing Unicode buffer. Please note that the width of a :ctype:`Py_UNICODE` character depends on compilation options (it is either 16 or 32 bits). The Python string must not contain embedded NUL characters; if it does, a :exc:`TypeError` exception is raised.
fr: Converti un objet Python Unicode en un pointeur C sur un tampon terminé par NUL de caractères Unicode. Vous devez fournir l'adresse d'une variable pointant sur un :ctype:`Py_UNICODE`, qui sera rempli avec le pointeur sur un tampon Unicode existant. Notez que la taille d'un caractère :ctype:`Py_UNICODE` dépend des options choisies à la compilation (16 ou 32 bits). La chaîne de caractères Python ne doit pas contenir de caractères NUL, sinon une exception :exc:`TypeError` sera levée.

source: Since ``u`` doesn't give you back the length of the string, and it may contain embedded NUL characters, it is recommended to use ``u#`` or ``U`` instead.
fr: Comme ``u`` ne vous donne pas en retour la longueur de la chaîne, et comme il peut contenir des caractères NUL, il est recommandé d'utiliser à la place ``u#`` ou ``U``.

source: This variant on ``u`` stores into two C variables, the first one a pointer to a Unicode data buffer, the second one its length.
fr: Cette variante de ``u`` stocke son résultat dans deux variables C, la première pointant vers un tampon de données Unicode, la seconde donnant sa longueur.

source: Like ``u``, but the Python object may also be ``None``, in which case the :ctype:`Py_UNICODE` pointer is set to *NULL*.
fr: Comme ``u``, mais l'objet Python peut aussi être ``None``, auquel cas le pointeur :ctype:`Py_UNICODE` est fixé à *NULL*.

source: Like ``u#``, but the Python object may also be ``None``, in which case the :ctype:`Py_UNICODE` pointer is set to *NULL*.
fr: Comme ``u#``, mais l'objet Python peut également être ``None``, auquel cas le pointeur :ctype:`Py_UNICODE` est fixé à *NULL*.

source: Requires that the Python object is a Unicode object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a Unicode object. The C variable may also be declared as :ctype:`PyObject\*`.
fr: Exige que l'objet Python soit un objet Unicode, sans tenter aucune conversion. Lève une :exc:`TypeError` si l'objet n'est pas un objet Unicode. La variable C peut également être déclarée en tant que :ctype:`PyObject\*`.

source: This format accepts any object which implements the read-write buffer interface. It fills a :ctype:`Py_buffer` structure provided by the caller. The buffer may contain embedded null bytes. The caller have to call :cfunc:`PyBuffer_Release` when it is done with the buffer.
fr: Ce format accepte n'importe quel objet qui implémente l'interface de mémoire tampon en lecture/écriture. Il remplit une structure :ctype:`Py_buffer` fournie par l'appelant. Le tampon peut contenir des octets nuls. L'appelant doit appeler :cfunc:`PyBuffer_Release` quand il n'a plus l'usage du tampon.

source: This variant on ``s`` is used for encoding Unicode into a character buffer. It only works for encoded data without embedded NUL bytes.
fr: Cette variante ``s`` est utilisée pour encoder de l'Unicode dans un buffer de caractères. Cela ne fonctionne que pour les données encodées qui ne contiennent pas d'octets NUL.

source: This format requires two arguments. The first is only used as input, and must be a :ctype:`const char\*` which points to the name of an encoding as a NUL-terminated string, or *NULL*, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :ctype:`char\*\*`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument.
fr: Ce format requiert deux arguments. Le premier est seulement utilisé en entrée, et doit être de type :ctype:`const char\*`. Il pointe sur une chaîne de caractères contenant le nom d'un encodage, terminée par NUL. Si cette chaîne contient *NULL*, l'encoding ``'utf-8'`` sera utilisé. Une exception sera levé si le nom de l'encodage est inconnu de Python. Le second argument doit être de type :ctype:`char\*\*`, la valeur du pointeur qu'il référence sera fixée à la valeur d'un tampon contenant le texte de l'argument. Le texte sera encodé avec l'encodage spécifié dans le premier argument.

source: :cfunc:`PyArg_ParseTuple` will allocate a buffer of the needed size, copy the encoded data into this buffer and adjust *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :cfunc:`PyMem_Free` to free the allocated buffer after use.
fr: :cfunc:`PyArg_ParseTuple` allouera un tampon de la taille nécessaire, copiera les données encodées dans ce tampon et fera pointer *\*buffer* vers le nouveau tampon alloué. L'appelant est responsable de l'invocation de :cfunc:`PyMem_Free` pour libérer le tampon alloué après utilisatiopn

source: Same as ``es`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
fr: Comme pour ``es``, excepté que les objets chaînes de caractères sont passées sans les ré-encoder. À la place, l'implémentation assume que l'objet chaîne de caractères utilise l'encodage passé en tant que paramètre.

source: This variant on ``s#`` is used for encoding Unicode into a character buffer. Unlike the ``es`` format, this variant allows input data which contains NUL characters.
fr: Cette variante de ``s#`` est utilisée pour encoder de l'Unicode dans un tampon de caractères. Contrairement au format ``es``, cette variante autorise les caractères NUL dans les données d'entrée.

source: It requires three arguments. The first is only used as input, and must be a :ctype:`const char\*` which points to the name of an encoding as a NUL-terminated string, or *NULL*, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :ctype:`char\*\*`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument. The third argument must be a pointer to an integer; the referenced integer will be set to the number of bytes in the output buffer.
fr: Ce format requiert deux arguments. Le premier est seulement utilisé en entrée, et doit être de type :ctype:`const char\*`. Il pointe sur une chaîne de caractères contenant le nom d'un encodage, terminée par NUL. Si cette chaîne contient *NULL*, l'encoding ``'utf-8'`` sera utilisé. Une exception sera levé si le nom de l'encodage est inconnu de Python. Le second argument doit être de type :ctype:`char\*\*`, la valeur du pointeur qu'il référence sera fixée à la valeur d'un tampon contenant le texte de l'argument. Le texte sera encodé avec l'encodage spécifié dans le premier argument. Le troisième argument doit être un pointeur sur un entier ; l'entier référencé sera positionné avec le nombre d'octets dans le tampon de sortie

source: There are two modes of operation:
fr: Il existe deux modes de fonctionnement :

source: If *\*buffer* points a *NULL* pointer, the function will allocate a buffer of the needed size, copy the encoded data into this buffer and set *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :cfunc:`PyMem_Free` to free the allocated buffer after usage.
fr: Si *\*buffer* pointe sur un pointeur *NULL*, la fonction allouera un tampon de la taille nécessaire, copiera les données encodées dans ce tampon et mettra dans *\*buffer* le nouveau tampon alloué. L'appelant est responsable de la libération de la mémoire après utilisation du tampon, par un appel à :cfunc:`PyMem_Free`.

source: If *\*buffer* points to a non-*NULL* pointer (an already allocated buffer), :cfunc:`PyArg_ParseTuple` will use this location as the buffer and interpret the initial value of *\*buffer_length* as the buffer size. It will then copy the encoded data into the buffer and NUL-terminate it. If the buffer is not large enough, a :exc:`ValueError` will be set.
fr: Si *\*buffer* pointe sur un pointeur qui n'est pas *NULL* (un tampon déjà alloué), :cfunc:`PyArg_ParseTuple` utilisera cet espace comme le tampon et interprétera la valeur initiale de *\*buffer_length* comme la taille du tampon. Il copiera alors les données encodées dans le tampon et terminera ce dernier par NUL. Si le tampon n'est pas de taille suffisante, une exception :exc:`ValueError` sera levée.

source: In both cases, *\*buffer_length* is set to the length of the encoded data without the trailing NUL byte.
fr: Dans les deux cas, *\*buffer_length* est la longueur des données encodées, sans l'octet NUL de fin.

source: Same as ``es#`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
fr: Comme pour ``es#`` excepté que les objets chaînes de caractères sont traités sans recodage. À la place, l'implémentation assume que les objets de type chaînes de caractères utilisent l'encodage passé en tant que paramètre.

source: Numbers
fr: Nombres

source: Convert a nonnegative Python integer to an unsigned tiny int, stored in a C :ctype:`unsigned char`.
fr: Convertit un entier Python positif ou nul en un unsigned tiny int, stocké dans un C :ctype:`unsigned char`.

source: Convert a Python integer to a tiny int without overflow checking, stored in a C :ctype:`unsigned char`.
fr: Convertit un entier Python en un tiny int sans vérifier le débordement, stocké dans un C :ctype:`unsigned char`.

source: Convert a Python integer to a C :ctype:`short int`.
fr: Convertit un entier Python en un C :ctype:`short int`.

source: Convert a Python integer to a C :ctype:`unsigned short int`, without overflow checking.
fr: Convertit un entier Python en un C :ctype:`unsigned short int`, sans contrôle de débordement.

source: Convert a Python integer to a plain C :ctype:`int`.
fr: Convertit un entier Python en un type C :ctype:`int`.

source: Convert a Python integer to a C :ctype:`unsigned int`, without overflow checking.
fr: Convertit un entier Python en un type C :ctype:`unsigned int`, sans contrôle de le débordement.

source: Convert a Python integer to a C :ctype:`long int`.
fr: Convertit un entier Python en un type :ctype:`long int`.

source: Convert a Python integer to a C :ctype:`unsigned long` without overflow checking.
fr: Convertit un entier Python en un type C :ctype:`unsigned long` sans en vérifier le débordement.

source: Convert a Python integer to a C :ctype:`long long`. This format is only available on platforms that support :ctype:`long long` (or :ctype:`_int64` on Windows).
fr: Convertit un entier Python en un type C :ctype:`long long`. Ce format est uniquement disponible sur les plates-formes qui prennent en charge :ctype:`long long` (ou :ctype:`_int64` sous Windows).

source: Convert a Python integer to a C :ctype:`unsigned long long` without overflow checking. This format is only available on platforms that support :ctype:`unsigned long long` (or :ctype:`unsigned _int64` on Windows).
fr: Convertit un entier Python en un type C :ctype:`unsigned long long` sans en vérifier le débordement. Ce format est uniquement disponible sur les plates-formes qui prennent en charge :ctype:`unsigned long long` (ou :ctype:`unsigned _int64` sous Windows).

source: Convert a Python integer to a C :ctype:`Py_ssize_t`.
fr: Convertit un entier Python en un type C :ctype:`Py_ssize_t`.
